ArchiveIncidentRequest.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
               xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <soap:Body xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
      <ims:ArchiveIncidentRequest xmlns:ims="http://uicds.org/IncidentManagementService">
         <ims:IncidentID xmlns:ims="http://uicds.org/IncidentManagementService">IG-27ebcaf4-f76a-4382-ab54-7a4574e52146</ims:IncidentID>
      </ims:ArchiveIncidentRequest>
  </soap:Body>
</soap:Envelope>
