GetIncidentRequest.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
    <SOAP-ENV:Header />
    <SOAP-ENV:Body>
        <ims:GetIncidentRequest xmlns:precisb="http://www.saic.com/precis/2009/06/base"
            xmlns:preciss="http://www.saic.com/precis/2009/06/structures" xmlns:ims="http://uicds.org/IncidentManagementService">
            <preciss:WorkProductIdentification>
                <precisb:Identifier xmlns:base="http://www.saic.com/precis/2009/06/base">Incident-7749f0f2-7dfc-42fa-97b1-e7170dc8c541</precisb:Identifier>
                <precisb:Version xmlns:base="http://www.saic.com/precis/2009/06/base">2</precisb:Version>
                <precisb:Type xmlns:base="http://www.saic.com/precis/2009/06/base">Incident</precisb:Type>
                <precisb:Checksum xmlns:base="http://www.saic.com/precis/2009/06/base">Sun Aug 24 12:53:17 EDT 2014:2:2:13580651</precisb:Checksum>
                <precisb:State xmlns:base="http://www.saic.com/precis/2009/06/base">Active</precisb:State>
            </preciss:WorkProductIdentification>
        </ims:GetIncidentRequest>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>

